projects/russian-transit/src/cfe/Русский_Транзит/Catalogs/ГруппыСтран.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГруппыСтран</Name>
			<Comment>Вспомогательный справочник для оптимизации алгоритмов заполнения цен</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СоставГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтраныГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтранаОформления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Catalogs/ГруппыСтран/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	пСоставГруппы = "";
	Для каждого Стр Из СтраныГруппы Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Страна) Тогда
			Продолжить;
		КонецЕсли;
		
		пСоставГруппы = пСоставГруппы + СокрЛП(Стр.Страна) + ", ";
		
	КонецЦикла;
	
	Если пСоставГруппы <> "" Тогда
		пСоставГруппы = Лев(пСоставГруппы, СтрДлина(пСоставГруппы)-2);
	КонецЕсли;
	
	//Если СтрДлина(пСоставГруппы) > 1000 Тогда
	//	пСоставГруппы = Лев(пСоставГруппы, 997) + "...";
	//КонецЕсли;
	
	Если пСоставГруппы <> СоставГруппы Тогда
		СоставГруппы = пСоставГруппы;
	КонецЕсли;
	
КонецПроцедуры
